ConnectTest/src/Documents/messageLogs/messageLogs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>messageLogs</name>
  <registerRecords>AccumulationRegister.pushStatus</registerRecords>
  <attributes>
    <name>error</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>informationChannel</name>
    <type>
      <types>EnumRef.informationChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>message</name>
    <type>
      <types>CatalogRef.messages</types>
    </type>
  </attributes>
  <attributes>
    <name>messageStatus</name>
    <type>
      <types>EnumRef.messageStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>recordDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>request</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>response</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>token</name>
    <type>
      <types>CatalogRef.tokens</types>
    </type>
  </attributes>
</mdclass:Document>

ConnectTest/src/Documents/messageLogs/Forms/ListForm/Module.bsl
&AtServerNoContext
Function getResponseBody(log)		
	CompressedBinaryData	= log.request.Get();
	request	= ?(CompressedBinaryData = Undefined, "", XDTOSerializer.XMLValue(Type("ValueStorage"), Base64String(CompressedBinaryData)).Get());	
	CompressedBinaryData	= log.response.Get();
	response	=  ?(CompressedBinaryData = Undefined, "", XDTOSerializer.XMLValue(Type("ValueStorage"), Base64String(CompressedBinaryData)).Get());
	Return New Structure("request, response", request, response);
EndFunction

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If parameters.Property("message") then
		element = List.Filter.Items.Add(Type("DataCompositionFilterItem"));
		element.LeftValue = new DataCompositionField("message");
		element.ComparisonType = DataCompositionComparisonType.Equal;
		element.RightValue = parameters.message;
		element.ViewMode = DataCompositionSettingsItemViewMode.Inaccessible;
	EndIf;
EndProcedure

&AtClient
Procedure ListOnActivateRow(Item)
	CurrentRow	= Items.List.CurrentRow;
	If CurrentRow <> Undefined Then
		answer		= getResponseBody(CurrentRow);
		request		= answer.request;
		response	= answer.response;
	EndIf;
EndProcedure
